In [1]:
import pandas as pd

file_to_load = "Resources/purchase_data.csv"

purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
unique_players = purchase_data["SN"].unique()
player_series = pd.Series(unique_players)
player_num = player_series.count()

player_df = pd.DataFrame({"Total Number of Players": [player_num]})
player_df

   Total Number of Players
0                      576

In [4]:
unique_items = purchase_data["Item ID"].unique()
unique_series = pd.Series(unique_items)
item_num = unique_series.count()

avg_buy = purchase_data["Price"].mean()

all_buys = purchase_data["Purchase ID"].count()

rev = purchase_data["Price"].sum()

buying_df = pd.DataFrame(
    {"Number of Unique Items": [item_num],
    "Average Price": [avg_buy],
    "Number of Purchases": [all_buys],
    "Total Revenue": rev})

buying_df["Average Price"] = buying_df["Average Price"].map("${:.2f}".format)
buying_df["Total Revenue"] = buying_df["Total Revenue"].map("${:.2f}".format)

buying_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

In [5]:
df1 = purchase_data.drop_duplicates(subset=['SN'],keep='first')
length = df1.shape[0]
df1 = pd.DataFrame(df1.groupby('Gender')['SN'].count()).rename(columns={'SN':'amount_gender'})
df1['pct_gender'] = df1['amount_gender'] / length
df1['pct_gender'] = round(df1['pct_gender']*100,2)
df1

                       amount_gender  pct_gender
Gender
Female                            81       14.06
Male                             484       84.03
Other / Non-Disclosed             11        1.91

In [11]:
df2 = pd.DataFrame(purchase_data.groupby("Gender")["Purchase ID"].count()).rename(columns = {"Purchase ID" : "Purchase Count"})
purchases = purchase_data.groupby("Gender")["Price"].sum()
people = purchase_data.groupby("Gender")["SN"].count()
df2["Average Purchase Price"] = round(purchases/df2["Purchase Count"],2)
df2["Total Purchase Price"] = purchases
df2["Average Total per Person"] = round(purchases/purchase_data.SN.nunique(),2)

df2["Average Purchase Price"] = df2["Average Purchase Price"].map("${:.2f}".format)
df2["Total Purchase Price"] = df2["Total Purchase Price"].map("${:.2f}".format)
df2["Average Total per Person"] = df2["Average Total per Person"].map("${:.2f}".format)
df2

,Purchase Count,Average Purchase Price,Total Purchase Price,Average Total per Person
Gender,,,,
Female,113,$3.20,$361.94,$0.63
Male,652,$3.02,$1967.64,$3.42
Other / Non-Disclosed,15,$3.35,$50.19,$0.09

In [22]:
bins = [0,10,14,19,24,29,34,39,1000]
ages = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

age_df = purchase_data.copy(deep = True)
age_df['Age Ranges'] = pd.cut(age_df['Age'], bins, labels=ages, include_lowest = True)
age_group = age_df.groupby('Age Ranges')

            Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Ranges
<10                  32   32   32      32       32         32     32
10-14                19   19   19      19       19         19     19
15-19               136  136  136     136      136        136    136
20-24               365  365  365     365      365        365    365
25-29               101  101  101     101      101        101    101
30-34                73   73   73      73       73         73     73
35-39                41   41   41      41       41         41     41
40+                  13   13   13      13       13         13     13